/* =============================================================================
 *
 * /￣￣￣` 　|￣￣￣￣￣￣￣￣￣￣￣￣|
 * |○　○| ＜　 モーターを動かそう！　|
 * +:----:+ 　|________________________|
 *  ￣￣￣
 * =============================================================================
 */

#include <EEPROM.h>
#include "JointController.h"

namespace
{
  PLEN2::JointController joint_ctrl;
}


void setup()
{
  joint_ctrl.loadSettings();
}

void loop()
{
  joint_ctrl.setAngle(1, 0);    // 1番のモーターを0°に動かすよ
  delay(1000); // ← かっこの中の数字を変えると、モーターが止まっている時間が変わるよ

  joint_ctrl.setAngle(1, 1200); // 1番のモーターを120.0°に動かすよ
  delay(1000); // ← かっこの中の数字を変えると、モーターが止まっている時間が変わるよ
}