/* =============================================================================
 *
 * /￣￣￣` 　|￣￣￣￣￣￣￣￣￣￣|
 * |○　○| ＜　 LEDを光らせよう！ |
 * +:----:+ 　|____________________|
 *  ￣￣￣
 * =============================================================================
 */

namespace
{
  static inline const int LED_OUT() { return 13; }
}


void setup()
{
  pinMode(LED_OUT(), OUTPUT);
}

void loop()
{
  digitalWrite(LED_OUT(), HIGH); // LEDを光らせるよ
  delay(1000); // ← かっこの中の数字を変えると、光っている時間が変わるよ

  digitalWrite(LED_OUT(), LOW);  // LEDを消すよ
  delay(1000); // ← かっこの中の数字を変えると、消えている時間が変わるよ
}
